articles/selflangs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-15 Fri 06:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<p>
= Communication is fake, actually =
-&#x2014;
Surely you've noticed it by now. People know and use different definitions of relatively common words in English. I don't know how it is outside of English, I'm not there. All I know is, this approaches absurdity.
</p>

<p>
Now, the evolution of language is a known thing. A thing so widely known as to be tiresome. And, as an extension of this, we have on the inner layer of culture slang, and on the outer layer loan-words.
</p>

<p>
But now in the age of the Internet, slang moves faster than ever. In fact, I would go so far as to say that its current trajectory can be likened to a snowball rolling down a mountain: innocuous, but inexorably accelerating till it hits the ground.
</p>

<p>
What's the ground? Babel. Total loss of mutual intellegibility. The older generations will maintain a fairly well-rooted dialect while their children and grandchildren sail far and away with a much smaller and more nuanced vocabulary.
</p>

<p>
-&#x2014;
</p>

<p>
This is not the problem I came here to talk about. It's just a fun look ahead (or in the mirror?) that lies tangent to the real issue:
</p>

<p>
<span class="underline">Every single person</span> speaks a different language.
</p>

<p>
Here's some arguments, for those who are into it.
</p>

<ol class="org-ol">
<li>The logical argument from thought:
<ul class="org-ul">
<li>All humans over the course of their development arrive at a unique cycle of thought</li>
<li>All verbal/linguistic expression is derived directly from thought</li>
<li>Thus, all verbal/linguistic expression is the product of a unique cycle of thought.</li>
</ul></li>
</ol>

<p>
that, my friend, is either a perfect syllogism or a cheap definitional cop-out. If your language distinguishes between those. Mine does but only when it's applied to something I disagree with.
</p>

<ol class="org-ol">
<li><ul class="org-ul">
<li>All misunderstandings are caused by different points of view</li>
<li>Different points of view are&#x2026;</li>
<li>Ack screw it this is just drawing an obvious conclusion that was foregone from the first line. sorry to waste your time.</li>
</ul></li>
</ol>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-04-15 Fri 06:59</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
